<!DOCTYPE html>
<html>
<head>
    <title> Задания по книге</title>
    <link href="https://cdnjs.cloudflare.com/ajax/libs/prism/1.24.1/themes/prism.min.css" rel="stylesheet">
    <style>
        body { font-family: Arial; line-height: 1.6; max-width: 800px; margin: 0 auto; padding: 20px; }
        .code-block { background: #f5f5f5; padding: 15px; border-radius: 5px; overflow-x: auto; }
        .download-section { margin: 30px 0; }
    </style>
</head>
<body>

<h1>Задание №1. Игра в числа</h1>
<h2>Цели</h2>
<p>Написать программу, которая не принимает аргументы, но может давать подсказки</p>
<h2>Задачи</h2>
<p> 1. Написать функцию (guessing_game), которая не при
нимает аргументы.
 <p>2. При вызове функция выбирает случайное целое число от 0
 до 100 (включительно). </p>
 <p> 3. Функция должна попросить пользователя угадать, какое число было </p>
 выбрано.
 <p>4. Каждый раз, когда пользователь будет вводить значение,
 программа будет показывать одно из следующих сообще
ний:
 <p> — Слишком большое </p>
<p> — Слишком маленькое </p>
 <p> — То, что нужно </p>
</p>
<h2>Инструменты и алгоритмы</h2>
<p>В основе этой программы лежит простое применение опера
торов сравнения ((==, < и >) и модуль random
для генерации случайного числа. После импортирования random
мы можем вызвать random.randint, которая принимает два па
раметра и возвращает случайное целое число. </p>
<h2>Ошибки и их исправления </h2>
<p>Следует обратить особое внимание на кострукцию while... try...</p>
<p>Результат может шокировать</p>
<h2>Выводы</h2>
<p> Цель упражнения —  помочь познакомиться с рядом
тем, которые понадобятся на протяжении всей
работе с Python: циклы, ввод данных пользователем, преобразо
вание типов и сравнение значений.</p>
<h3>Решение</h3>
<div class="code-block">
<pre><code class="language-python">
# игра со случайными числами
import random
number = random.randint(0, 100)
ans = None
while number != ans:
    try:
        ans = int(input("Число: "))
        if number < ans:
            print ("меньше")
        elif number > ans:
            print ("больше")
        else:
            print("вы угадали")
    except ValueError:
        print("введите целое")

</code></pre>
</div>

<div class="download-section">
    <h3>Сcылка на GitHub</h3>
    <ul>
        <li><a href="https://github.com/ssdfrrr/lab_report/blob/B/b1%20(%D0%B8%D0%B3%D1%80%D0%B0%20%D1%81%20%D1%87%D0%B8%D1%81%D0%BB%D0%B0%D0%BC%D0%B8).py" download>Исходный код (b1 (игра с числами).py)</a></li>
    </ul>
</div>

<!-- Подключение скриптов для подсветки кода -->
<script src="https://cdnjs.cloudflare.com/ajax/libs/prism/1.24.1/prism.min.js"></script>
<script src="https://cdnjs.cloudflare.com/ajax/libs/prism/1.24.1/components/prism-python.min.js"></script>

</body>
</html>